In [256]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

In [257]:
# afficher les résultats en entier
pd.set_option('display.max_row',100)
pd.set_option('display.max_column', 50)

In [258]:
# chargement du fichier csv
df = pd.read_csv('SBAnational.csv')

C:\Users\nicol\AppData\Local\Temp\ipykernel_23380\1245351179.py:2: DtypeWarning: Columns (9) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('SBAnational.csv')

In [259]:
# Vérification des types des variables
df.dtypes

LoanNr_ChkDgt          int64
Name                  object
City                  object
State                 object
Zip                    int64
Bank                  object
BankState             object
NAICS                  int64
ApprovalDate          object
ApprovalFY            object
Term                   int64
NoEmp                  int64
NewExist             float64
CreateJob              int64
RetainedJob            int64
FranchiseCode          int64
UrbanRural             int64
RevLineCr             object
LowDoc                object
ChgOffDate            object
DisbursementDate      object
DisbursementGross     object
BalanceGross          object
MIS_Status            object
ChgOffPrinGr          object
GrAppv                object
SBA_Appv              object
dtype: object

## Gestion des valeurs manquantes

In [260]:
# détection des valeurs manquantes
df.isnull().sum()

LoanNr_ChkDgt             0
Name                     14
City                     30
State                    14
Zip                       0
Bank                   1559
BankState              1566
NAICS                     0
ApprovalDate              0
ApprovalFY                0
Term                      0
NoEmp                     0
NewExist                136
CreateJob                 0
RetainedJob               0
FranchiseCode             0
UrbanRural                0
RevLineCr              4528
LowDoc                 2582
ChgOffDate           736465
DisbursementDate       2368
DisbursementGross         0
BalanceGross              0
MIS_Status             1997
ChgOffPrinGr              0
GrAppv                    0
SBA_Appv                  0
dtype: int64

In [261]:
# remplacer les valeurs manquantes de la variable 'Name' par 'unknown'
df['Name'] = df['Name'].fillna('unknown')

In [262]:
# remplacer les valeurs manquantes de la variable 'City' par 'unknown'
df['City'] = df['City'].fillna('unknown')

In [263]:
df.isnull().sum()

LoanNr_ChkDgt             0
Name                      0
City                      0
State                    14
Zip                       0
Bank                   1559
BankState              1566
NAICS                     0
ApprovalDate              0
ApprovalFY                0
Term                      0
NoEmp                     0
NewExist                136
CreateJob                 0
RetainedJob               0
FranchiseCode             0
UrbanRural                0
RevLineCr              4528
LowDoc                 2582
ChgOffDate           736465
DisbursementDate       2368
DisbursementGross         0
BalanceGross              0
MIS_Status             1997
ChgOffPrinGr              0
GrAppv                    0
SBA_Appv                  0
dtype: int64

In [264]:
df.loc[df['State'].isnull()]

,LoanNr_ChkDgt,Name,City,State,Zip,Bank,BankState,NAICS,ApprovalDate,ApprovalFY,Term,NoEmp,NewExist,CreateJob,RetainedJob,FranchiseCode,UrbanRural,RevLineCr,LowDoc,ChgOffDate,DisbursementDate,DisbursementGross,BalanceGross,MIS_Status,ChgOffPrinGr,GrAppv,SBA_Appv
35517,1270833006,SO. JERSEY DANCE/MERRYLEES,PENNSVILLE,NaN,8070,NaN,NaN,0,28-Jul-81,1981,120,1,2.0,0,0,0,0,N,N,5-Mar-90,NaN,$0.00,$0.00,NaN,"$11,364.00","$15,000.00","$15,000.00"
49244,1380800010,TRYON COATS & LEATHER,JOHNSTOWN NY,NaN,0,KEYBANK NATIONAL ASSOCIATION,NY,0,18-May-66,1966,282,0,0.0,0,0,0,0,N,N,29-Mar-90,16-Aug-66,"$60,000.00",$0.00,CHGOFF,"$6,084.00","$60,000.00","$54,000.00"
264664,2850643009,CENTURY 21 PHILLIPS REALTY,CAMERON PARK,NaN,95682,SBA - EDF ENFORCEMENT ACTION,CO,0,12-Feb-87,1987,240,19,1.0,0,19,0,0,N,N,NaN,17-Jun-87,"$81,000.00",$0.00,P I F,$0.00,"$83,000.00","$83,000.00"
306274,3113583009,THE COMPUTER EDGE,"BOX 267, APO AP",NaN,96205,RTC/WESTPORT SAVINGS BANK,CA,541511,21-Jan-88,1988,73,8,1.0,0,0,0,0,N,N,18-Sep-93,16-Mar-88,"$50,000.00",$0.00,CHGOFF,"$30,589.00","$50,000.00","$45,000.00"
328526,3280213000,KING'S TRUCK WASH,WICHITA,NaN,67219,SOUTH CENT. KANSAS ECONOMIC DE,KS,811192,5-Aug-88,1988,120,17,2.0,10,7,0,0,N,N,NaN,12-Jul-89,"$119,000.00",$0.00,P I F,$0.00,"$119,000.00","$119,000.00"
351072,3445553007,JAMES A. NICHOLS,"1542,TABUK,SAUDI ARABIA",NaN,79925,WELLS FARGO BANK NATL ASSOC,TX,532230,19-May-89,1989,16,1,2.0,0,0,0,0,N,N,NaN,31-Jul-89,"$60,000.00",$0.00,P I F,$0.00,"$60,000.00","$54,000.00"
366139,3556993002,"GOLF SHOES UNLIMITED, INC.",PALM BEACH GARDENS,NaN,33410,"BEAL BANK, SSB",TX,451110,19-Oct-89,1990,84,3,2.0,0,0,1,0,N,N,NaN,31-Jan-90,"$75,000.00",$0.00,P I F,$0.00,"$75,000.00","$67,500.00"
366158,3557093005,CASCO SERVICE,CASCO,NaN,54205,UNION STATE BANK,WI,0,19-Oct-89,1990,204,8,1.0,0,0,1,0,N,N,NaN,30-Apr-90,"$300,000.00",$0.00,P I F,$0.00,"$300,000.00","$252,600.00"
367007,3563473008,P & P TOOL INC,SOMERSET,NaN,54025,FIRST BANK OF BALDWIN,WI,0,26-Oct-89,1990,240,7,1.0,0,0,1,0,N,N,NaN,31-Jan-90,"$82,000.00",$0.00,P I F,$0.00,"$82,000.00","$73,800.00"
379174,3664443009,WILLIAMS JEWELERS,SALT LAKE CITY,NaN,84124,ZIONS FIRST NATIONAL BANK,UT,448310,14-Dec-89,1990,60,4,1.0,0,0,1,0,N,N,NaN,31-Jul-90,"$250,000.00",$0.00,P I F,$0.00,"$250,000.00","$212,500.00"
385418,3714383003,"LAKE MOVIE TYMES, INC.",LAKE OZARK,NaN,65049,CENTRAL BK OF LAKE OF OZARKS,MO,532230,4-Jan-90,1990,60,1,1.0,0,0,1,0,N,N,NaN,31-Jan-90,"$75,000.00",$0.00,P I F,$0.00,"$75,000.00","$67,500.00"
869948,9390913007,"OLSON ELECTRIC SERVICE, INC.",A452638533,NaN,75236,PROSPERITY BANK,TX,235310,9-Jul-96,1996,60,17,1.0,0,0,1,0,N,Y,NaN,31-Jul-96,"$40,000.00",$0.00,P I F,$0.00,"$40,000.00","$32,000.00"
871847,9416233003,METRO SHEETMETAL & ERECTION,A452638533,NaN,76052,PROSPERITY BANK,TX,235610,23-Jul-96,1996,84,3,1.0,0,0,1,0,N,Y,NaN,31-Jul-96,"$80,000.00",$0.00,P I F,$0.00,"$80,000.00","$64,000.00"
885335,9690723000,"VERANDA INTERIORS, INC.",A452638533,NaN,76645,PROSPERITY BANK,TX,0,24-Oct-96,1997,120,3,1.0,0,0,1,0,N,N,NaN,31-Jan-97,"$100,000.00",$0.00,P I F,$0.00,"$100,000.00","$80,000.00"

## Déduction des valeurs manquantes pour les variables 'State' et 'Zip'

In [265]:
df.loc[35517,'State'] = "NJ"

In [266]:
df.loc[49244, 'State'] = "NY"
df.loc[49244, 'City'] = "JOHNSTOWN"
df.loc[49244, 'Zip'] = 12095

In [267]:
df.loc[264664,"State"] = "CA"

In [268]:
df.loc[328526, 'State'] = "KS"

In [269]:
df.loc[351072, 'City'] = 'EL PASO'
df.loc[351072, 'State'] = 'TX'

In [270]:
df.loc[366139, 'State'] = "FL"

In [271]:
df.loc[366158, 'State'] = "WI"

In [272]:
df.loc[367007,"State"] ="WI"

In [273]:
df.loc[379174,'State'] = "UT"

In [274]:
df.loc[385418, 'State'] = "MO"

In [275]:
df.loc[869948,'State'] = 'TX'

In [276]:
df.loc[871847, 'State'] = 'TX'

In [277]:
df.loc[885335, 'State'] = 'TX'

In [278]:
df.loc[306274, 'State'] = 'unknown'

In [279]:
# remplacer les valeurs manquantes de la variable 'Bank' par 'unknown'
df['Bank'] = df['Bank'].fillna('unknown')

In [280]:
# remplacer les valeurs manquantes de la variable 'BankState' par 'unknown'
df['BankState'] = df['BankState'].fillna('unknown')

In [281]:
# convertir les valeurs manquantes de la variable 'NewExist' en 0 et en type 'int'
df['NewExist'] = df['NewExist'].fillna(0)
df['NewExist'] = df['NewExist'].astype(int)

In [282]:
df.dtypes

LoanNr_ChkDgt         int64
Name                 object
City                 object
State                object
Zip                   int64
Bank                 object
BankState            object
NAICS                 int64
ApprovalDate         object
ApprovalFY           object
Term                  int64
NoEmp                 int64
NewExist              int64
CreateJob             int64
RetainedJob           int64
FranchiseCode         int64
UrbanRural            int64
RevLineCr            object
LowDoc               object
ChgOffDate           object
DisbursementDate     object
DisbursementGross    object
BalanceGross         object
MIS_Status           object
ChgOffPrinGr         object
GrAppv               object
SBA_Appv             object
dtype: object

### Variable 'RevLineCr'

In [283]:
df['RevLineCr'].value_counts()

RevLineCr
N    420288
0    257602
Y    201397
T     15284
1        23
R        14
`        11
2         6
C         2
,         1
3         1
7         1
A         1
5         1
.         1
4         1
-         1
Q         1
Name: count, dtype: int64

In [284]:
# Remplacer toutes les valeurs de la variable 'RevLineCr' sauf "Y" et "N" par 0 (unknown)
df.loc[~df['RevLineCr'].isin(['Y', 'N']), 'RevLineCr'] = "0"
# remplacer les valeurs "N" (no) par 1 
df['RevLineCr'] = df['RevLineCr'].str.replace("N", "1")
# remplacer les valeurs "Y" (yes) par 2
df['RevLineCr'] = df['RevLineCr'].str.replace("Y", "2")

# convertir la variable en type int
df['RevLineCr'] = df['RevLineCr'].astype(int)

### Variable 'LowDoc'

In [285]:
df['LowDoc'].value_counts()

LowDoc
N    782822
Y    110335
0      1491
C       758
S       603
A       497
R        75
1         1
Name: count, dtype: int64

In [286]:
# Remplacer toutes les valeurs de la variable 'LowDoc' sauf "Y" et "N" par 0 (unknown)
df.loc[~df['LowDoc'].isin(['Y', 'N']), 'LowDoc'] = "0"

# remplacer les valeurs "N" (no) par 1 
df['LowDoc'] = df['LowDoc'].str.replace("N", "1")

# remplacer les valeurs "Y" (yes) par 2
df['LowDoc'] = df['LowDoc'].str.replace("Y", "2")

# convertir la variable en type int
df['LowDoc'] = df['LowDoc'].astype(int)

In [287]:
df['LowDoc'].value_counts()

LowDoc
1    782822
2    110335
0      6007
Name: count, dtype: int64

### Variables 'DisbursementGross', 'BalanceGross', 'ChgOffPrinGr', 'GrAppv', 'SBA_Appv'

In [288]:
# supprimer des virgules
df['DisbursementGross'] = df['DisbursementGross'].str.replace(',','')

# supprimer des dollars
df['DisbursementGross'] = df['DisbursementGross'].str.replace('$','')

# transformation de la variable en type float
df['DisbursementGross'] = df['DisbursementGross'].astype(float)

In [289]:
# supprimer des virgules
df['BalanceGross'] = df['BalanceGross'].str.replace(',','')

# supprimer des dollars
df['BalanceGross'] = df['BalanceGross'].str.replace('$','')

# transformation de la variable en type float
df['BalanceGross'] = df['BalanceGross'].astype(float)

In [290]:
# supprimer des virgules
df['ChgOffPrinGr'] = df['ChgOffPrinGr'].str.replace(',','')

# supprimer des dollars
df['ChgOffPrinGr'] = df['ChgOffPrinGr'].str.replace('$','')

# transformation de la variable en type float
df['ChgOffPrinGr'] = df['ChgOffPrinGr'].astype(float)

In [291]:
# supprimer des virgules
df['GrAppv'] = df['GrAppv'].str.replace(',','')

# supprimer des dollars
df['GrAppv'] = df['GrAppv'].str.replace('$','')

# transformation de la variable en type float
df['GrAppv'] = df['GrAppv'].astype(float)

In [292]:
# supprimer des virgules
df['SBA_Appv'] = df['SBA_Appv'].str.replace(',','')

# supprimer des dollars
df['SBA_Appv'] = df['SBA_Appv'].str.replace('$','')

# transformation de la variable en type float
df['SBA_Appv'] = df['SBA_Appv'].astype(float)

### variable 'MIS_Status

In [293]:
df['MIS_Status'].isnull().value_counts()

MIS_Status
False    897167
True       1997
Name: count, dtype: int64

In [294]:
# Suppression des lignes ne comportant pas de valeur sur la variable 'MIS_Status'
df = df[~df['MIS_Status'].isnull()]

In [295]:
# convertir variable MIS_Status
df.loc[df['MIS_Status'].isin(["P I F"]), 'MIS_Status'] = 1
df.loc[df['MIS_Status'].isin(["CHGOFF"]), 'MIS_Status'] = 0
df['MIS_Status'] = df['MIS_Status'].astype(int)

In [296]:
df.head(1)

,LoanNr_ChkDgt,Name,City,State,Zip,Bank,BankState,NAICS,ApprovalDate,ApprovalFY,Term,NoEmp,NewExist,CreateJob,RetainedJob,FranchiseCode,UrbanRural,RevLineCr,LowDoc,ChgOffDate,DisbursementDate,DisbursementGross,BalanceGross,MIS_Status,ChgOffPrinGr,GrAppv,SBA_Appv
0,1000014003,ABC HOBBYCRAFT,EVANSVILLE,IN,47711,FIFTH THIRD BANK,OH,451120,28-Feb-97,1997,84,4,2,0,0,1,0,1,2,NaN,28-Feb-99,60000.0,0.0,1,0.0,60000.0,48000.0

### variable 'NAICS'

In [297]:
df['NAICS'].value_counts()

NAICS
0         201667
722110     27941
722211     19435
811111     14539
621210     14034
           ...
112420         1
316212         1
336414         1
315240         1
311311         1
Name: count, Length: 1312, dtype: int64

In [298]:
# conserver uniquement les 2 premiers chiffres de chaque valeur
def convert_two_numbers(number):
    number_to_str = str(number)
    transform_number = number_to_str[:2]
    return int(transform_number)

new_naics = []
for item in df['NAICS']:
    new_item= convert_two_numbers(item)
    new_naics.append(new_item)

df['NAICS'] = new_naics

In [299]:
df['NAICS'].unique()

array([45, 72, 62,  0, 33, 81, 23, 44, 42, 61, 53, 54, 31, 51, 71, 52, 21,
       32, 56, 48, 11, 92, 22, 49, 55])

### Variable 'FranchiseCode'

In [300]:
df['FranchiseCode'].value_counts()

FranchiseCode
1        637395
0        208040
78760      3373
68020      1921
50564      1034
          ...
89009         1
23118         1
56574         1
1561          1
48820         1
Name: count, Length: 2767, dtype: int64

In [301]:
# convertir les valeurs '1' en '0' signifiant 'No franchise' 
# convertir les valeurs différentes de '0' en '1' signifiant 'franchise' 
df.loc[df['FranchiseCode'].isin([1]), 'FranchiseCode'] = 0
df.loc[~df['FranchiseCode'].isin([0]), 'FranchiseCode'] = 1

In [302]:
df['FranchiseCode'].value_counts()

FranchiseCode
0    845435
1     51732
Name: count, dtype: int64

In [303]:
df.sample(1)

,LoanNr_ChkDgt,Name,City,State,Zip,Bank,BankState,NAICS,ApprovalDate,ApprovalFY,Term,NoEmp,NewExist,CreateJob,RetainedJob,FranchiseCode,UrbanRural,RevLineCr,LowDoc,ChgOffDate,DisbursementDate,DisbursementGross,BalanceGross,MIS_Status,ChgOffPrinGr,GrAppv,SBA_Appv
173130,2238194005,HOWARD JOHNSON,KISSIMMEE,FL,34744,FLORIDA 1ST CAP. FINAN CORPORA,FL,0,5-Aug-98,1998,240,26,1,6,20,1,0,1,1,NaN,15-Sep-99,1000000.0,0.0,1,0.0,1000000.0,1000000.0

### Variable 'ApprovalDate'

In [304]:
df['ApprovalDate'].unique()

array(['28-Feb-97', '2-Jun-80', '7-Feb-06', ..., '24-Feb-97', '25-Feb-97',
       '27-Feb-97'], shape=(9836,), dtype=object)

In [305]:
# Convertir la valeur en ne conserver que l'année

# Récupérer les 2 dernières chiffres de la valeur correspondant à une année
df['ApprovalDate'] = df['ApprovalDate'].apply(lambda x: x[-2:])

# Concaténer "20" à la valeur lorsque cette dernière commence par "0" ou "1", sinon concaténer "19"
df['ApprovalDate'] = df['ApprovalDate'].apply(lambda x: "20" + x if x.startswith('0') or x.startswith('1') else "19" + x)

# transformer la variable en type integer
df['ApprovalDate'] = df['ApprovalDate'].astype(int)

In [306]:
# Vérification de la transformation
df['ApprovalDate'].unique()

array([1997, 1980, 2006, 1996, 1998, 1999, 2000, 2001, 1971, 2002, 2003,
       2004, 1972, 1978, 1981, 2005, 1979, 1982, 1966, 1983, 1984, 1985,
       2007, 1986, 1987, 1973, 2008, 1988, 1989, 2009, 1991, 1990, 2010,
       2011, 1992, 1993, 2012, 1994, 2013, 1975, 1976, 1974, 2014, 1977,
       1968, 1969, 1970, 1995])

# Variable 'ApprovalFY'

In [307]:
df['ApprovalFY'].unique()

array([1997, 1980, 2006, 1998, 1999, 2000, 2001, 1972, 2003, 2004, 1978,
       1979, 1981, 2005, 1982, 1966, 1983, 1973, 1984, 2007, 1985, 1986,
       1987, 2008, 1988, 2009, 1989, 1991, 1990, 1974, 2010, 2011, 1992,
       1993, 2002, 2012, 2013, 1994, 2014, 1975, 1977, 1976, '2004',
       '1994', '1979', '1976', '1975', '1974', '1977', '1981', '1982',
       '1983', '1984', '1978', '1980', '1968', '1976A', '1969', '1995',
       '1970', '2005', '1996', '1971', 1996, 1971], dtype=object)

In [308]:
# convertir en type str
df['ApprovalFY'] = df['ApprovalFY'].astype(str)

# supprimer les éléments non numériques concaténés aux valeurs
df['ApprovalFY'] = df['ApprovalFY'].str.replace("A","")

# convertir en type int
df['ApprovalFY'] = df['ApprovalFY'].astype(int)

In [309]:
# Vérification
df['ApprovalFY'].unique()

array([1997, 1980, 2006, 1998, 1999, 2000, 2001, 1972, 2003, 2004, 1978,
       1979, 1981, 2005, 1982, 1966, 1983, 1973, 1984, 2007, 1985, 1986,
       1987, 2008, 1988, 2009, 1989, 1991, 1990, 1974, 2010, 2011, 1992,
       1993, 2002, 2012, 2013, 1994, 2014, 1975, 1977, 1976, 1968, 1969,
       1995, 1970, 1996, 1971])

### Création de la variable 'crysis_year' correspondant la validation du prêt durant une période de crise économique

In [310]:
# Liste comprenant les années correspondant aux crises économiques des Etats-Unis 
# 1973 - 1975 : crise pétrolière
# 1980 - 1982 : crise inflationniste (récession)
# 1990 : invasion du Koweit
# 2007 - 2009 : Crise des Subprimes

crysis_list = [1973, 1974, 1975, 1980, 1981, 1982, 1990, 2007, 2008, 2009]
df['crysis_year'] = df['ApprovalFY'].apply(lambda x: "yes" if x in crysis_list else "no")

In [311]:
# Vérification
df['crysis_year'].unique()

array(['no', 'yes'], dtype=object)

### Vérifications finales

In [312]:
# vérification des types des variables
df.dtypes

LoanNr_ChkDgt          int64
Name                  object
City                  object
State                 object
Zip                    int64
Bank                  object
BankState             object
NAICS                  int64
ApprovalDate           int64
ApprovalFY             int64
Term                   int64
NoEmp                  int64
NewExist               int64
CreateJob              int64
RetainedJob            int64
FranchiseCode          int64
UrbanRural             int64
RevLineCr              int64
LowDoc                 int64
ChgOffDate            object
DisbursementDate      object
DisbursementGross    float64
BalanceGross         float64
MIS_Status             int64
ChgOffPrinGr         float64
GrAppv               float64
SBA_Appv             float64
crysis_year           object
dtype: object

In [313]:
# Vérification des valeurs manquantes
df.isnull().sum()

LoanNr_ChkDgt             0
Name                      0
City                      0
State                     0
Zip                       0
Bank                      0
BankState                 0
NAICS                     0
ApprovalDate              0
ApprovalFY                0
Term                      0
NoEmp                     0
NewExist                  0
CreateJob                 0
RetainedJob               0
FranchiseCode             0
UrbanRural                0
RevLineCr                 0
LowDoc                    0
ChgOffDate           734729
DisbursementDate       2175
DisbursementGross         0
BalanceGross              0
MIS_Status                0
ChgOffPrinGr              0
GrAppv                    0
SBA_Appv                  0
crysis_year               0
dtype: int64

In [314]:
# Création d'un fichier csv nettoyé
df.to_csv("sba_national_clean.csv", index = False)